Infineon/mtb-pdl-cat2/devices/include/cy8c4147lde_hv704.h
/* IP List */
#define CY_IP_M0S8TTCANFD               1u
#define CY_IP_M0S8TTCANFD_INSTANCES     1u
#define CY_IP_M0S8TTCANFD_VERSION       1u
#define CY_IP_ARMCM0P                   1u
#define CY_IP_ARMCM0P_INSTANCES         0u
#define CY_IP_ARMCM0P_VERSION           1u
#define CY_IP_M0S8CPUSSV3               1u
#define CY_IP_M0S8CPUSSV3_INSTANCES     1u
#define CY_IP_M0S8CPUSSV3_VERSION       3u
#define CY_IP_M0S8CPUSSV3_DMAC          1u
#define CY_IP_M0S8CPUSSV3_DMAC_INSTANCES 1u
#define CY_IP_M0S8CPUSSV3_DMAC_VERSION  3u
#define CY_IP_M0S8EXCO                  1u
#define CY_IP_M0S8EXCO_INSTANCES        1u
#define CY_IP_M0S8EXCO_VERSION          2u
#define CY_IP_M0S8HVSS                  1u
#define CY_IP_M0S8HVSS_INSTANCES        1u
#define CY_IP_M0S8HVSS_VERSION          2u
#define CY_IP_M0S8IOSS                  1u
#define CY_IP_M0S8IOSS_INSTANCES        1u
#define CY_IP_M0S8IOSS_VERSION          1u
#define CY_IP_M0S8ISOUART               1u
#define CY_IP_M0S8ISOUART_INSTANCES     1u
#define CY_IP_M0S8ISOUART_VERSION       1u
#define CY_IP_MXLIN                     1u
#define CY_IP_MXLIN_INSTANCES           1u
#define CY_IP_MXLIN_VERSION             1u
#define CY_IP_M0S8PACSS                 1u
#define CY_IP_M0S8PACSS_INSTANCES       1u
#define CY_IP_M0S8PACSS_VERSION         1u
#define CY_IP_M0S8PERI                  1u
#define CY_IP_M0S8PERI_INSTANCES        1u
#define CY_IP_M0S8PERI_VERSION          1u
#define CY_IP_M0S8PERI_TR               1u
#define CY_IP_M0S8PERI_TR_INSTANCES     1u
#define CY_IP_M0S8PERI_TR_VERSION       1u
#define CY_IP_M0S8SCB                   1u
#define CY_IP_M0S8SCB_INSTANCES         2u
#define CY_IP_M0S8SCB_VERSION           2u
#define CY_IP_M0S8SRSSHV                1u
#define CY_IP_M0S8SRSSHV_INSTANCES      1u
#define CY_IP_M0S8SRSSHV_VERSION        1u
#define CY_IP_M0S8TCPWM                 1u
#define CY_IP_M0S8TCPWM_INSTANCES       1u
#define CY_IP_M0S8TCPWM_VERSION         2u

#define CY_DEVICE_PSOC4HVPAPPM
#define CY_DEVICE_SERIES_PSOC_4_HVPA_SPM_1_0
#define CY_SILICON_ID                   0x370411C7UL
#define CY_HF_CLK_MAX_FREQ              49152000UL


#include "system_cat2.h"

#include "psoc4hvpaspm10_config.h"
#include "gpio_psoc4hvpaspm10_48_qfn.h"

/*******************************************************************************
*                                    SFLASH
*******************************************************************************/

#define SFLASH_BASE                             0x0FFFE000UL
#define SFLASH                                  ((SFLASH_Type*) SFLASH_BASE)                                      /* 0x0FFFE000 */

/*******************************************************************************
*                                     PERI
*******************************************************************************/

#define PERI_BASE                               0x40010000UL
#define PERI                                    ((PERI_Type*) PERI_BASE)                                          /* 0x40010000 */
#define PERI_TR_GROUP0                          ((PERI_TR_GROUP_Type*) &PERI->TR_GROUP[0])                        /* 0x40012000 */
#define PERI_TR_GROUP1                          ((PERI_TR_GROUP_Type*) &PERI->TR_GROUP[1])                        /* 0x40012200 */
#define PERI_TR_GROUP2                          ((PERI_TR_GROUP_Type*) &PERI->TR_GROUP[2])                        /* 0x40012400 */
#define PERI_TR_GROUP3                          ((PERI_TR_GROUP_Type*) &PERI->TR_GROUP[3])                        /* 0x40012600 */
#define PERI_TR_GROUP4                          ((PERI_TR_GROUP_Type*) &PERI->TR_GROUP[4])                        /* 0x40012800 */
#define PERI_TR_GROUP5                          ((PERI_TR_GROUP_Type*) &PERI->TR_GROUP[5])                        /* 0x40012A00 */
#define PERI_TR_GROUP6                          ((PERI_TR_GROUP_Type*) &PERI->TR_GROUP[6])                        /* 0x40012C00 */

/*******************************************************************************
*                                    HSIOM
*******************************************************************************/

#define HSIOM_BASE                              0x40020000UL
#define HSIOM                                   ((HSIOM_Type*) HSIOM_BASE)                                        /* 0x40020000 */
#define HSIOM_PRT0                              ((HSIOM_PRT_Type*) &HSIOM->PRT[0])                                /* 0x40020000 */
#define HSIOM_PRT1                              ((HSIOM_PRT_Type*) &HSIOM->PRT[1])                                /* 0x40020100 */
#define HSIOM_PRT2                              ((HSIOM_PRT_Type*) &HSIOM->PRT[2])                                /* 0x40020200 */
#define HSIOM_PRT3                              ((HSIOM_PRT_Type*) &HSIOM->PRT[3])                                /* 0x40020300 */
#define HSIOM_PRT4                              ((HSIOM_PRT_Type*) &HSIOM->PRT[4])                                /* 0x40020400 */

/*******************************************************************************
*                                    SRSSHV
*******************************************************************************/

#define SRSSHV_BASE                             0x40030000UL
#define SRSSHV                                  ((SRSSHV_Type*) SRSSHV_BASE)                                      /* 0x40030000 */
#define WDT                                     ((WDT_Type*) &SRSSHV->WDT_STRUCT)                                 /* 0x40030100 */

/*******************************************************************************
*                                     GPIO
*******************************************************************************/

#define GPIO_BASE                               0x40040000UL
#define GPIO                                    ((GPIO_Type*) GPIO_BASE)                                          /* 0x40040000 */
#define GPIO_PRT0                               ((GPIO_PRT_Type*) &GPIO->PRT[0])                                  /* 0x40040000 */
#define GPIO_PRT1                               ((GPIO_PRT_Type*) &GPIO->PRT[1])                                  /* 0x40040100 */
#define GPIO_PRT2                               ((GPIO_PRT_Type*) &GPIO->PRT[2])                                  /* 0x40040200 */
#define GPIO_PRT3                               ((GPIO_PRT_Type*) &GPIO->PRT[3])                                  /* 0x40040300 */
#define GPIO_PRT4                               ((GPIO_PRT_Type*) &GPIO->PRT[4])                                  /* 0x40040400 */

